# SpotTextFromLeader Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotTextFromLeader Property
ParameterTypeId Class See Also
---
"Text Offset from Leader"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotTextFromLeader { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotTextFromLeader As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotTextFromLeader {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace